import 'package:flutter/material.dart';
import 'package:kfs_online/models/medical.dart';


const DUMMY_Medical = const[
  Medical(
      id : 'c1',
      title : 'الصيدليات',
      color: Colors.black26,
      imageAssest:  'images/medical/icon/medicine.png'
  ),
  Medical(
      id : 'c2',
      title : 'معامل التحاليل',
      color: Colors.black26,
      imageAssest:  'images/medical/icon/lab.png'
  ),
  Medical(
      id : 'c3',
      title : 'حضانات الاطفال',
      color: Colors.black26,
      imageAssest:  'images/medical/icon/baby.png'
  ),
  Medical(
      id : 'c4',
      title : 'مراكز الأشعة',
      color: Colors.black26,
      imageAssest:  'images/medical/icon/skeleton.png'
  ),
];


const DUMMY_Medical1 = const [
  // C1 Categories (  الصيدليات  )
  Medical1(
    id: 'm1',
    categories: [
      'c1',
    ],
    title: 'صيدلية الأندلس',
    imageUrl: 'images/medical/1.jpg',
    info: ["إدارة دكتور / جمال عبدالفتاح","تأسست عام 1986",
    "خدمة صيدلانيــة متــميزة على مـــدار 24 ساعـــة",
    "العنوان : عمارات الاوقاف عمارة ٦ شارع حافظ بدوي امام المستشفي العام",
    "0473226866"],
    location: "",
    number: "0473226866",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
  Medical1(
    id: 'm2',
    categories: [
      'c1',
    ],
    title: 'صيدليه الامل',
    imageUrl:
    'images/medical/2.jpg',
    info: ["العنوان : شارع النبوي المهندس بجوار مخبوزات كلاسيك امام town team للملابس الرجالى",
    "مواعيد العمل",
    "من السبت الى الخميس : 10:00 صباحاً الى 2:00 صباحاً",
    "الجمعه : 1:00 ظهراً الى 2:00 صباحاً",
    "0473215658"],
    location: "",
    number: "0473215658",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
Medical1(
    id: 'm3',
    categories: [
      'c1',
    ],
    title: 'صيدلية عمر',
    imageUrl:
    'images/medical/3.jpg',
    info: ["العنوان : تقاطع النبوي المهندس مع ابراهيم المغازي",
    "مواعيد العمل",
    "8:00 صباحاً الى 3:00 فجراً طوال ايام الاسبوع",
    "تقدم خدمة التوصيل",
    "0473215658"],
    location: "",
    number: "0473215658",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
  Medical1(
    id: 'm4',
    categories: [
      'c1',
    ],
    title: 'صيدلية المنسى',
    imageUrl:
    'images/medical/4.png',
    info: ["فرع شارع الخليفه",
    "العنوان : شارع الخليفه المامون امام فرع we",
    "0473224049",
    "فرع شارع جيهان",
    "العنوان : شارع جيهان امام مستشفى الفتح",
    "0473216886",
    "مواعيد العمل",
    "كل يوم : من 9:00 صباحاً الى 2:00 صباحاً",
    "ماعدا الجمعه : من 2:00 عصراً الى 2:00 صباحاً",
    "تقدم خدمة التوصيل"],
    location: "",
    number: "0473224049",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
    Medical1(
    id: 'm5',
    categories: [
      'c1',
    ],
    title: 'صيدلية علاء الدين',
    imageUrl:
    'images/medical/5.jpg',
    info: ["إدارة دكتور / حسام علاء الدين",
    "تأسست عام 1986",
    "توفير الأدوية و المستحضرات الطبية المحلية و المستوردة",
    "العنوان : شارع سكة روينه بجوار مستشفى عمر بن الخطاب للتأمينات",
    "مواعيد العمل : خدمة 24 ساعة",
    "0473223739",
    "مواعيد العمل"],
    location: "",
    number: "0473223739",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
  // C2 Categories (  معامل التحاليل )

  Medical1(
    id: 'm6',
    categories: [
      'c2'
    ],
    title: 'معــامــل الدلتـــــا',
    imageUrl:
    'images/medical/6.png',
    info: ["الفرع الأول عمارات المحاربين برج الوسام 2",
    "للتواصل : 01090220963",
    "الفرع الثاني شارع مستشفي الزهراء برج الروضه بجوار مستشفي الزهراء",
    "للتواصل : 01095600369",
    "الفرع الثالث سخا الشارع العمومي امام مدرسه سخا",
    "للتواصل : 01010178815",
    "الفرع الرابع عمارات مجلس المدينه امام الجمعيه الزراعيه",
    "للتواصل : 01014288227",
    "مواعيدالعمل بجميع الفروع من 9 ص ل 10م"],
    location: "",
    number: "01090220963",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
  Medical1(
    id: 'm7',
    categories: [
      'c2',
    ],
    title: 'معمل الساعة',
    imageUrl: 'images/medical/7.jpg',
    info: ["احدث أجهزة التحليل في مصر لأول مرة في كفرالشيخ",
    "العنوان : برج الكوثر أمام مستشفى الرمد بكفرالشيخ",
    "مواعيد العمل",
    "من السبت الى الخميس : 9:00 صباحاً الى 10:00 مساءً",
    "الجمعه : اجازه",
    "رقم الهاتف : 01012727927"],
    location: "",
    number: "01012727927",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
  Medical1(
    id: 'm8',
    categories: [
      'c2',
    ],
    title: 'معامل الشعراوي',
    imageUrl: 'images/medical/8.jpg',
    info: ["فرع اول المحاربين الجديده وعلي سوبر ماركت هايبر يو",
    "0473238182",
    "فرع ثاني امام بوابه الاسعاف و معهد الكبد برج اللؤلؤه طريق الموقف",
    "0473238180",
    "فرع ثالث نهايه شارع القماشين فوق اهل السنه و مغسله جاد",
    "0473238180",
    "مواعيد العمل 24 ساعه"],
    location: "",
    number: "0473238182",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
    Medical1(
    id: 'm9',
    categories: [
      'c2',
    ],
    title: 'معامل خضر للتحاليل الطبية',
    imageUrl: 'images/medical/9.jpg',
    info: ["العنوان ابراج فينيسيا ٢ امام مزلقان الانشاء والتعمير الاوقاف برج الضارائب",
    "امام الامين للمأكولات الشعبيه",
    "مواعيد العمل من 10 صباحاً لـ 10 مساءً"],
    location: "",
    number: "",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
      Medical1(
    id: 'm10',
    categories: [
      'c2',
    ],
    title: 'معمل الهدى',
    imageUrl: 'images/medical/10.jpg',
    info: ["دكتور / أحمد أمين",
    "أستاذ التحاليل الطبية بكلية الطب",
    "إستشاري التحاليل الطبية وفيروسات الكبد بمركز الكبد",
    "العنوان :كفرالشيخ – المحاربين الجديدة – برج هداية",
    "0473144727"],
    location: "",
    number: "0473144727",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
  // C3 Categories (  حضانات الاطفال  )

  Medical1(
    id: 'm11',
    categories: [
      'c3',
    ],
    title: 'مركز شرابي للأطفال',
    imageUrl: 'images/medical/11.jpg',
    info: ["لعلاج الأطفال وحديثي الولادة",
    "د/ أحمد فرج شرابي",
    "العنوان :كفرالشيخ – شارع الـ 47 عمارة",
    "مواعيد العمل :24 ساعة",
    "0473160216"],
    location: "",
    number: "0473160216",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
  //----------------------
  //C4    (مراكز الأشعة)
  //-----------------------
  Medical1(
      id: 'm12',
      categories: [
        'c4',
      ],
      title: 'مركز الزيتون للأشعة',
      imageUrl: 'images/medical/12.jpg',
      info: ["كفرالشيخ – شارع الخلفاء الراشدين",
      "يومياً 24 ساعة طوال الإسبوع",
      "0473145199"],
      location: "",
      number: "0473145199",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
  Medical1(
      id: 'm13',
      categories: [
        'c4',
      ],
      title: 'طنطا سكان للأشعة',
      imageUrl: 'images/medical/13.jpg',
      info: ["العنوان : المحاربين الجديده بجوار صيدليه عصمت",
      "مواعيد العمل ١٠ الي ١٠ يومياً"],
      location: "",
      number: "",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
    Medical1(
      id: 'm14',
      categories: [
        'c4',
      ],
      title: 'مركز بانوراما سكان',
      imageUrl: 'images/medical/14.jpg',
      info: ["لأشعة الأسنان وبانوراما الفكين",
      "العنوان: المحاربين الجديده امام مزقان الانشاء والتعمير برج المأوي اعلي حلواني اكلير",
      "مواعيد العمل : ٩ الي ١٠ يومياً",
      "جمعه اجازه"],
      location: "",
      number: "",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
  Medical1(
      id: 'm15',
      categories: [
        'c4',
      ],
      title: 'مركز كفرالشيخ سكان',
      imageUrl: 'images/medical/15.jpg',
      info: ["العنوان المحاربين الجديده بجوار صيدليه عصمت",
      "للتواصل",
      "0473145155"],
      location: "",
      number: "0473145155",
      imgList: [
        "",
        "",
        "",
        "",]
  ),
];

